{
  "hcloud": {
    "name": "hcloud",
    "title": {
      "subtitle": "현대 클라우드 서비스",
      "title": "HCloud",
      "tag": "Vue3|Nuxt3|Pinia|Vuetify",
      "color": "#3537ff|#000000",
      "content": "현대 클라우드 서비스 사이트로 규모가 굉장히 컸던 프로젝트입니다. 컴포넌트 작업부터 시작하여 페이지 작업, API 연동, 검수 및 수정 후 운영단계로 전환되어 운영단계에서는 다른 팀원분들은 철수하시고 혼자서 프로젝트를 진행하게 되었습니다.",
      "feel": "클라우드 서비스인만큼 사용자 권한에 따른 메뉴 접근 제한, 다국어 처리 등의 복잡한 작업을 진행했으며 React 프로젝트를 진행하다가 Vue를 사용하는 프로젝트에 투입된 것으로 <span class='point'>두 가지의 차이점</span>이 느껴졌는데 Vue의 사용방법이 조금 더 직관적이며 간단하게 느껴졌습니다. Vue를 사용한 작업이 처음이었으므로 뜻깊었으며 그 외에 Nuxt를 메타 프레임워크로 사용하고 Pinia를 통해 상태 관리하는 작업을 해볼 수 있어 좋은 경험이 되었습니다."
    },
    "kind": {
      "date": "2023.08 (10months)",
      "techStack": "Vue3, Nuxt3, Vuetify, Pinia, Tanstack Query, Axios",
      "work": "Total : 35%",
      "url": ""
    },
    "zigzag": {
      "1": {
        "title": "컴포넌트 작업",
        "content": "페이지가 굉장히 많고 하나의 컴포넌트가 여러 군데에 다양한 타입과 기능으로 사용되어 작업 전 다른 페이지를 모두 확인하여 타입을 정리했습니다. 작업한 컴포넌트는 storybook과 guide 페이지를 통해 다른 팀원분들께 props나 slot 등의 사용방법을 전달드렸습니다."
      },
      "2": {
        "title": "외부 백엔드 개발자분들과의 협업, 커뮤니케이션",
        "content": "현대 백엔드 개발자분들과 협업하며 기본적으로는 API에 대한 문서나 Swagger, 포스트맨 등을 제공받았지만 프론트 작업 중 발생한 이슈 등에 대해 미팅 및 슬랙 등으로 소통하여 커뮤니케이션을 진행했습니다."
      },
      "3": {
        "title": "API 연동",
        "content": "데이터 상태 관리는 Tanstack Query, 통신 라이브러리는 Axios를 사용하여 작업을 진행하였으며 API 연동을 진행하며 데이터에 따른 화면 노출, 사용자 검색 기능 등 다양한 기능을 구현했습니다."
      },
      "4": {
        "title": "다국어 작업",
        "content": "Nuxt용 i18n 모듈을 통해 다국어 작업을 진행했으며 모든 페이지 작업이 완료된 후 한국어로 작성되어 있는 모든 텍스트를 다국어로 변환해야 했으므로 기술적인 어려움보다는 텍스트 추출과 반복작업에 대한 어려움이 있었습니다."
      },
      "5": {
        "title": "작업일지 작성",
        "content": "작업 항목을 누락하지 않고 진행률을 파악하기 위해 매일 작업일지를 작성하고 진행한 작업과 진행 예정인 항목을 정리했습니다."
      },
      "6": {
        "title": "운영업무",
        "content": "전반적인 구축 종료 후에는 운영업무를 맡게 되어 수정사항, 추가 페이지 사항, 백엔드 개발자분들과의 소통 등을 혼자 진행했으며 현대 환경에 정기적으로 소스코드를 배포했습니다. 다른 동료분들이 작업한 코드를 수정하며 다른 페이지에서 오류가 발생하지 않을지 부담이 있었지만 수정한 컴포넌트가 사용되는 다른 페이지도 검수하며 더욱 꼼꼼하게 확인했습니다."
      }
    }
  },
  "grape": {
    "name": "grape",
    "title": {
      "subtitle": "DFY 사내 인트라넷",
      "title": "Grape",
      "tag": "React18|Remix|Supabase|Emotion",
      "color": "#9146ff|#772ce8|#ee7f02|#2ae240",
      "content": "재직하던 회사의 사내 인트라넷 사이트입니다. 초기에는 게시물, 회원 정도의 기능만 탑재 후 오픈하여 지속적으로 고도화할 계획인 프로젝트였지만, 후반부에 다른 프로젝트 어사인으로 인해 홀딩 된 프로젝트입니다.",
      "feel": "비록 홀딩 되었지만 백엔드는 다루지 않았던 다른 프로젝트와는 다르게 DB 구조에 대한 논의부터 시작하여 <span class='point'>사용해 보지 않은 프레임워크</span> 등을 사용해 볼 수 있어 좋은 경험이 된 프로젝트입니다."
    },
    "kind": {
      "date": "2022.10 (5months)",
      "techStack": "React18, Remix, Supabase, Emotion, Mantine, CloudFlare",
      "work": "Total : 40%",
      "url": ""
    },
    "zigzag": {
      "1": {
        "title": "게시물 CRUD 기능과 무한 스크롤",
        "content": "Remix와 Supabase의 문법을 사용하여 게시물 CRUD 기능을 구현했으며 커스텀 훅을 만들어 게시물 목록에 따라 불러올 데이터의 수, 데이터를 지정하여 무한 스크롤이 가능하게 작업했습니다. 그 외에도 현재 날씨를 노출하는 커스텀 훅 등의 작업을 진행했습니다."
      },
      "2": {
        "title": "DB 구조",
        "content": "작업하는 페이지의 DB와 구조는 작업자가 직접 세팅하여 게시물에 들어가는 사용자 정보, 내용 등을 어떻게 가져와서 노출시킬 것인지 직접 고민하여 세팅하고 프론트와 백엔드의 연동과 흐름을 더욱 명확하게 느끼며 작업했습니다."
      },
      "3": {
        "title": "Tiptap 라이브러리",
        "content": "게시물 작성은 마크다운 문법을 사용하였으며 슬래시(/) 작성 시 툴팁 노출, 드래그 시 툴팁 노출, GIPHY와 Unsplash API를 사용해 이미지 파일 첨부, 사용자 멘션, 해시태그 기능 등 Tiptap 라이브러리를 커스텀 하여 게시물 작성 시 여러 가지 기능을 제공할 수 있게 구현했습니다."
      },
      "4": {
        "title": "Git Issues, PR 활용",
        "content": "작업 현황 공유와 작업 방식 통일 등을 위해 이슈와 PR을 활용해 서로의 코드를 보완, 확인할 수 있게 하여 동료와 커뮤니케이션을 원활하게 진행할 수 있었습니다."
      }
    }
  },
  "kids": {
    "name": "kids",
    "title": {
      "subtitle": "LG U+ 아이들나라",
      "title": "아이들 나라",
      "tag": "Handlebars|Splide|가로스크롤",
      "color": "#ffe552|#ffcfd8|#c2eaf3|#b2e9de",
      "content": "LG U+ 아이들나라의 컨텐츠를 소개하고 이용권을 결제 할 수 있는 사이트입니다. 저는 70% 정도의 퍼블리싱을 맡았으며 콘텐츠 맛보기, 요금제, 소식, 이벤트, 자주 묻는 질문, 로그인, 회원가입 등의 대부분의 페이지 작업을 진행했습니다.",
      "feel": "Handlebars.js를 사용하여 레이아웃을 컴포넌트 단위로 관리할 수 있었으며 하나의 컴포넌트를 여러 타입으로 스타일을 분기해 처리해야 했으므로 스타일이 꼬이지 않게 유의하며 작업했습니다. 스크립트 또한 모듈로 묶어 <span class='point'>범용적으로</span> 사용할 수 있게 작업을 진행한 프로젝트 입니다."
    },
    "kind": {
      "date": "2022.06 (2months)",
      "techStack": "HTML, SCSS, JAVASCRIPT, Handlebars.js",
      "work": "Total : 70%",
      "url": "https://kid-3fb.pages.dev/"
    },
    "zigzag": {
      "1": {
        "title": "Splide.js 슬라이드",
        "content": "여러 페이지에서 슬라이드가 사용되어 각 슬라이드에 맞게 처리하기 위해 for 문으로 슬라이드의 개수만큼 반복시켜 실행해 사이트 내에서 사용되는 모든 슬라이드 기능에 문제가 없게 처리했습니다. 슬라이드의 타입을 정의하고 switch case문으로 타입별로 분기하여 기능을 처리했습니다."
      },
      "2": {
        "title": "가로스크롤, 비디오, GIF 제어",
        "content": "Scrader.js를 통해 레이아웃을 고정하여 가로스크롤 기능을 구현하였으며, 각 아이템이 중앙에 오는 순간에 비디오와 GIF가 재생되도록 구현했습니다."
      },
      "3": {
        "title": "아코디언 기능 작업",
        "content": "케이스가 다른 아코디언 기능을 공통적으로 관리하기 위해 하나의 컴포넌트에 클래스를 분리하여 여러 케이스를 수용할 수 있게 작업했습니다."
      }
    }
  },
  "naver1784": {
    "name": "naver1784",
    "title": {
      "subtitle": "네이버 1784 소개 사이트",
      "title": "네이버 1784",
      "tag": "Handlebars|Swiper|마이크로 인터랙션|이미지 시퀀스",
      "color": "#000000",
      "content": "네이버 신사옥 1784 소개 사이트로 스크롤 인터랙션의 비중이 큰 사이트입니다. 가로스크롤 작업, 앵커 작업, 다국어 작업 등 원페이지지만 여러 기능이 들어가서 주의해야 할 부분이 많았습니다. tabindex 등의 <span class='point'>접근성</span>을 고려하며 여러 인터랙션이 들어간 만큼 사용에 불편함이 없게 하기 위해 여러 번 QA를 진행했습니다.",
      "feel": "그동안 혼자 공부했던 스크롤 인터랙션을 적용해 볼 수 있는 기회였습니다. Handlebars.js를 사용하여 템플릿 작업을 했으며 <span class='point'>BEM 방법론</span>과 SCSS를 통해 효율적으로 스타일링 하는 방법을 익혔습니다. 다국어 사이트이며 비주얼적인 사이트이기 때문에 스타일을 수정했을 때 다른 언어에 차질이 없는지 꼼꼼히 확인하는 습관을 익힐 수 있어 좋은 경험이 된 프로젝트입니다."
    },
    "kind": {
      "date": "2022.03 (1months)",
      "techStack": "HTML, SCSS, JAVASCRIPT, Handlebars.js",
      "work": "Total : 35%",
      "url": "https://1784.navercorp.com"
    },
    "zigzag": {
      "1": {
        "title": "Scradar.js를 사용하여 스크롤 인터랙션 구현",
        "content": "사내 자체제작 라이브러리를 사용하여 스크롤 인터랙션을 구현했습니다."
      },
      "2": {
        "title": "이미지 시퀀스 인터랙션",
        "content": "해당 레이아웃은 스크롤에 따라 Video의 currentTime을 제어하여 작업하려 했으나, 크로스 브라우징 문제로 이미지 시퀀스를 사용하여 인터랙션을 적용했습니다."
      },
      "3": {
        "title": "가로스크롤 인터랙션",
        "content": "사이트에서 비중이 큰 레이아웃인 만큼 가로스크롤, Marquee, 스크롤 딜레이, 모바일 Swiper 등 생각할 부분이 많았습니다. 모바일에서는 슬라이드로 사용되게 작업하여 Swiper 라이브러리에 대해 심도 있게 공부할 수 있었습니다."
      }
    }
  }
}
